dpcivl/lora_tester/lora_tester_stm32/Core/Src/SDStorage.c
#include "SDStorage.h"
#include "logger.h"
#include <string.h>
#include <stdio.h>

// 플랫폼별 HAL 헤더
#ifdef STM32F746xx
#include "stm32f7xx_hal.h"
extern UART_HandleTypeDef huart6;
extern SD_HandleTypeDef hsd1;  // SD 핸들 선언 추가
#endif

// 플랫폼별 조건부 컴파일
#ifdef STM32F746xx
#include "fatfs.h"
#include "main.h"  // RTC handle과 타입 정의
#else
// PC/테스트 환경에서는 파일 I/O 시뮬레이션
#include <time.h>
#include <stdio.h>
#include <stdlib.h>
#endif

// 내부 상태 관리
static bool g_sd_ready = false;
static char g_current_log_file[256] = {0};
static size_t g_current_log_size = 0;
static bool g_directory_available = false;  // 디렉토리 사용 가능 여부

#ifdef STM32F746xx
// 지속적 파일 핸들 시스템 (한 번 열어두고 계속 사용)
static FIL g_persistent_log_file;  // 지속적으로 열려있는 로그 파일
static bool g_file_is_open = false;  // 파일이 열려있는 상태 추적

// 기존 방식 보존 (주석 처리)
// static FIL* g_current_file_handle = NULL;  // 현재 열린 파일 핸들 추적
// static char g_current_open_file[256] = {0};  // 현재 열린 파일명 추적
#else
static FILE* g_log_file = NULL;
#endif

// 내부 함수 구현 - 함수 호출 순서에 맞게 배치
#ifdef STM32F746xx
static int _generate_log_filename(char* filename, size_t max_len)
{
    // 8.3 형식 파일명 생성 - 기존 파일 확인하여 중복 방지
    static int file_counter = 0;  // 0부터 시작하여 첫 번째 호출에서 1로 설정
    
    // 첫 번째 호출에서만 기존 파일 확인
    if (file_counter == 0) {
        file_counter = 1;
        
        // 기존 파일들 확인하여 다음 번호 찾기
        for (int i = 1; i <= 9999; i++) {
            char test_filename[256];
            FIL test_file;
            
            if (g_directory_available) {
                snprintf(test_filename, sizeof(test_filename), "lora_logs/LORA%04d.TXT", i);
            } else {
                snprintf(test_filename, sizeof(test_filename), "LORA%04d.TXT", i);
            }
            
            // 파일이 존재하는지 확인
            FRESULT test_result = f_open(&test_file, test_filename, FA_READ);
            if (test_result == FR_OK) {
                f_close(&test_file);
                file_counter = i + 1;  // 다음 번호로 설정
            } else {
                break;  // 파일이 없으면 현재 번호 사용
            }
        }
        
        LOG_DEBUG("[SDStorage] Auto-detected next log file number: %d", file_counter);
    }
    
    // 디렉토리 사용 가능 여부에 따라 경로 결정
    int result;
    if (g_directory_available) {
        // lora_logs 디렉토리에 파일 생성 (TXT 형식)
        result = snprintf(filename, max_len, "lora_logs/LORA%04d.TXT", file_counter);
    } else {
        // 루트 디렉토리에 파일 생성 (TXT 형식)
        result = snprintf(filename, max_len, "LORA%04d.TXT", file_counter);
    }
    
    file_counter++;
    
    if (result < 0 || (size_t)result >= max_len) {
        return SDSTORAGE_ERROR;
    }
    
    return SDSTORAGE_OK;
}

// 지속적 파일 핸들 관리 함수들
static void _ensure_persistent_file_open(void) {
    if (!g_file_is_open || strlen(g_current_log_file) == 0) {
        // 파일이 열려있지 않거나 파일명이 없으면 새로 열기
        if (g_file_is_open) {
            f_close(&g_persistent_log_file);
            g_file_is_open = false;
        }
        
        // 파일명 생성 (필요시)
        if (strlen(g_current_log_file) == 0) {
            _generate_log_filename(g_current_log_file, sizeof(g_current_log_file));
        }
        
        // 파일 열기 (append 모드)
        FRESULT open_result = f_open(&g_persistent_log_file, g_current_log_file, FA_OPEN_APPEND | FA_WRITE);
        if (open_result != FR_OK) {
            // 파일이 없으면 생성
            open_result = f_open(&g_persistent_log_file, g_current_log_file, FA_CREATE_ALWAYS | FA_WRITE);
        }
        
        if (open_result == FR_OK) {
            g_file_is_open = true;
            LOG_DEBUG("[SDStorage] Persistent file opened: %s", g_current_log_file);
        } else {
            LOG_ERROR("[SDStorage] Failed to open persistent file: %d", open_result);
        }
    }
}

static void _close_persistent_file(void) {
    if (g_file_is_open) {
        f_close(&g_persistent_log_file);
        g_file_is_open = false;
        LOG_DEBUG("[SDStorage] Persistent file closed: %s", g_current_log_file);
    }
}

// 기존 방식 보존 (주석 처리)
/*
static void _ensure_file_closed(void) {
    if (g_current_file_handle != NULL) {
        LOG_DEBUG("[SDStorage] Force closing previously opened file: %s", g_current_open_file);
        f_close(g_current_file_handle);
        g_current_file_handle = NULL;
        memset(g_current_open_file, 0, sizeof(g_current_open_file));
    }
}

static void _register_file_opened(FIL* file_handle, const char* filename) {
    g_current_file_handle = file_handle;
    strncpy(g_current_open_file, filename, sizeof(g_current_open_file) - 1);
    g_current_open_file[sizeof(g_current_open_file) - 1] = '\0';
}

static void _register_file_closed(void) {
    g_current_file_handle = NULL;
    memset(g_current_open_file, 0, sizeof(g_current_open_file));
}
*/
#endif

// 내부 함수 선언
static int _create_log_directory(void);
static void _close_persistent_file(void);
// static uint32_t _get_current_timestamp(void); - unused function removed

int SDStorage_Init(void)
{
#ifdef STM32F746xx
    // STM32 환경: FatFs 초기화 및 진단
    LOG_INFO("[SDStorage] Starting SD card initialization...");
    
    // 초기화 시 지속적 파일 닫기
    _close_persistent_file();
    
    // 1. 하드웨어 상태 진단 및 TRANSFER 상태까지 대기
    extern SD_HandleTypeDef hsd1;
    HAL_SD_CardStateTypeDef card_state = HAL_SD_GetCardState(&hsd1);
    LOG_INFO("[SDStorage] Initial SD card state: %d", card_state);
    
    // SD 카드가 TRANSFER 상태가 될 때까지 대기 (성공 프로젝트 패턴)
    int wait_count = 0;
    while (card_state != HAL_SD_CARD_TRANSFER && wait_count < 50) {  // 최대 5초 대기
        LOG_INFO("[SDStorage] Waiting for SD card TRANSFER state... (attempt %d)", wait_count + 1);
        HAL_Delay(100);
        card_state = HAL_SD_GetCardState(&hsd1);
        wait_count++;
    }
    
    if (card_state == HAL_SD_CARD_TRANSFER) {
        LOG_INFO("[SDStorage] ✅ SD card reached TRANSFER state successfully");
        
        // SDMMC 에러 코드 상세 체크 (성공 프로젝트 패턴)
        if (hsd1.ErrorCode != HAL_SD_ERROR_NONE) {
            LOG_WARN("[SDStorage] SDMMC ErrorCode detected: 0x%08X", hsd1.ErrorCode);
            
            if (hsd1.ErrorCode & SDMMC_ERROR_TX_UNDERRUN) {
                LOG_WARN("[SDStorage] TX_UNDERRUN detected - clock may be too fast");
            }
            if (hsd1.ErrorCode & SDMMC_ERROR_DATA_CRC_FAIL) {
                LOG_WARN("[SDStorage] CRC_FAIL detected - cache issue possible");
                SCB_CleanInvalidateDCache();
            }
            
            // 에러 코드 클리어
            hsd1.ErrorCode = HAL_SD_ERROR_NONE;
        }
    } else {
        LOG_ERROR("[SDStorage] ❌ SD card failed to reach TRANSFER state (state: %d)", card_state);
        LOG_ERROR("[SDStorage] SDMMC ErrorCode: 0x%08X", hsd1.ErrorCode);
        return SDSTORAGE_ERROR;
    }
    
    DSTATUS disk_status = disk_initialize(0);
    LOG_INFO("[SDStorage] disk_initialize result: 0x%02X", disk_status);
    
    // disk_initialize 실패 시 조기 종료 (블로킹 방지)
    if (disk_status != 0) {
        LOG_ERROR("[SDStorage] disk_initialize failed - SD card not ready");
        LOG_ERROR("[SDStorage] Possible causes: write-protected, bad card, or BSP/HAL conflict");
        return SDSTORAGE_ERROR;
    }
    
    // 2. 파일시스템 마운트 시도 (지연 마운트로 변경 - 블로킹 방지)
    LOG_INFO("[SDStorage] Using deferred mount (flag=0) to avoid blocking...");
    
    // f_mount 호출 전에 충분한 지연 (SD 카드 안정화)
    #ifdef STM32F746xx
    LOG_INFO("[SDStorage] Waiting for SD card stabilization (500ms)...");
    HAL_Delay(500);
    #endif
    
    // f_mount 블로킹 문제 - 완전 우회 시도
    LOG_WARN("[SDStorage] f_mount consistently blocks despite all fixes");
    LOG_INFO("[SDStorage] Attempting direct file operations without f_mount...");
    LOG_INFO("[SDStorage] Some FatFs implementations support auto-mount on first file access");
    
    // f_mount 여러 번 재시도 (성공 프로젝트 패턴)
    LOG_INFO("[SDStorage] Attempting f_mount with retry logic...");
    FRESULT mount_result = FR_DISK_ERR;  // 초기값
    
    for (int retry = 0; retry < 3; retry++) {
        LOG_INFO("[SDStorage] f_mount attempt %d/3...", retry + 1);
        mount_result = f_mount(&SDFatFS, SDPath, 1);  // 즉시 마운트
        LOG_INFO("[SDStorage] f_mount result: %d", mount_result);
        
        if (mount_result == FR_OK) {
            LOG_INFO("[SDStorage] ✅ f_mount successful on attempt %d", retry + 1);
            break;
        } else {
            LOG_WARN("[SDStorage] f_mount failed on attempt %d, retrying in 1000ms...", retry + 1);
            if (retry < 2) {  // 마지막 시도가 아니면 대기
                // STM32F7 D-Cache 클리어 (성공 프로젝트 패턴)
                LOG_INFO("[SDStorage] Clearing D-Cache for STM32F7 compatibility...");
                SCB_CleanInvalidateDCache();
                HAL_Delay(1000);
            }
        }
    }
    
    // 즉시 마운트 성공 시 쓰기 준비 완료
    if (mount_result == FR_OK) {
        LOG_INFO("[SDStorage] Immediate mount successful - SD ready for write operations");
    }
    
    if (mount_result != FR_OK) {
        LOG_WARN("[SDStorage] f_mount failed with result: %d", mount_result);
        
        // SD 카드가 이미 포맷되어 있다면 f_mkfs 시도하지 않고 다른 접근법 사용
        if (mount_result == FR_DISK_ERR) {
            LOG_WARN("[SDStorage] FR_DISK_ERR detected - SD card may be formatted but incompatible");
            LOG_INFO("[SDStorage] Skipping f_mkfs since SD card is already FAT32 formatted");
            LOG_INFO("[SDStorage] Trying alternative mount approach...");
            
            // 다른 마운트 방식 시도 (지연 마운트)
            LOG_INFO("[SDStorage] Attempting deferred mount (flag=0)...");
            mount_result = f_mount(&SDFatFS, SDPath, 0);
            LOG_INFO("[SDStorage] Deferred mount result: %d", mount_result);
            
            if (mount_result == FR_OK) {
                LOG_INFO("[SDStorage] Deferred mount successful!");
            } else {
                LOG_ERROR("[SDStorage] Both immediate and deferred mount failed");
                LOG_ERROR("[SDStorage] SD card may have hardware compatibility issues");
                return SDSTORAGE_ERROR;
            }
        }
        else if (mount_result == FR_NOT_READY || mount_result == FR_NO_FILESYSTEM) {
            // 작업 버퍼 할당 (전역 또는 스택)
            static BYTE work[_MAX_SS];
            
            // 실제 f_mkfs 시도
            LOG_INFO("[SDStorage] Attempting to create filesystem with f_mkfs...");
            FRESULT mkfs_result = f_mkfs(SDPath, FM_ANY, 0, work, sizeof(work));
            LOG_INFO("[SDStorage] f_mkfs(FM_ANY) result: %d", mkfs_result);
            
