dpcivl/lora_tester/lora_tester_stm32/Core/Src/SDStorage.c
            if (mkfs_result != FR_OK) {
                // FAT32로 다시 시도
                LOG_INFO("[SDStorage] Retrying with explicit FAT32 format...");
                mkfs_result = f_mkfs(SDPath, FM_FAT32, 4096, work, sizeof(work));
                LOG_INFO("[SDStorage] f_mkfs(FM_FAT32) result: %d", mkfs_result);
                
                if (mkfs_result != FR_OK) {
                    LOG_ERROR("[SDStorage] File system creation failed: %d", mkfs_result);
                    LOG_ERROR("[SDStorage] Possible SD card hardware issue - try different card");
                    return SDSTORAGE_ERROR;
                }
            }
            
            // 파일시스템 생성 후 재마운트 시도
            mount_result = f_mount(&SDFatFS, SDPath, 1);
            LOG_INFO("[SDStorage] Re-mount after mkfs result: %d", mount_result);
            
            if (mount_result != FR_OK) {
                LOG_ERROR("[SDStorage] Re-mount failed after mkfs: %d", mount_result);
                return SDSTORAGE_ERROR;
            }
        } else {
            LOG_ERROR("[SDStorage] Mount failed with unrecoverable error: %d", mount_result);
            return SDSTORAGE_ERROR;
        }
    }
    
    LOG_INFO("[SDStorage] File system mount successful");
#else
    // PC/테스트 환경: 시뮬레이션
    LOG_INFO("[SDStorage] Test environment - simulating successful initialization");
#endif

    // FatFs 마운트 성공 확인됨
    
    // 디렉토리 생성 시도
    LOG_INFO("[SDStorage] Creating log directory...");
    int dir_result = _create_log_directory();
    g_directory_available = (dir_result == SDSTORAGE_OK);
    
    g_sd_ready = true;
    
    // 기존 로그 파일명이 있으면 보존, 크기는 리셋하지 않음
    if (strlen(g_current_log_file) > 0) {
        LOG_INFO("[SDStorage] Preserving existing log file: %s (size: %d bytes)", 
                 g_current_log_file, g_current_log_size);
    } else {
        // 첫 초기화인 경우에만 크기와 파일명 초기화
        g_current_log_size = 0;
        memset(g_current_log_file, 0, sizeof(g_current_log_file));
        LOG_INFO("[SDStorage] First initialization - log file will be created on first write");
    }
    
    LOG_INFO("[SDStorage] Initialization completed successfully");
    return SDSTORAGE_OK;
}

int SDStorage_WriteLog(const void* data, size_t size)
{
    if (!g_sd_ready) {
        return SDSTORAGE_NOT_READY;
    }
    
    if (data == NULL || size == 0) {
        return SDSTORAGE_INVALID_PARAM;
    }
    
    // 새 로그 파일이 필요한 경우 생성 (파일 크기 체크는 일단 생략)
    if (strlen(g_current_log_file) == 0) {
        if (SDStorage_CreateNewLogFile() != SDSTORAGE_OK) {
            return SDSTORAGE_FILE_ERROR;
        }
    }

#ifdef STM32F746xx
    // 새로운 방식: 지속적 파일 핸들 사용 (한 번 열어두고 계속 쓰기)
    _ensure_persistent_file_open();
    
    if (!g_file_is_open) {
        LOG_ERROR("[SDStorage] Cannot open persistent file");
        return SDSTORAGE_FILE_ERROR;
    }
    
    // 데이터 + 줄바꿈 추가하여 쓰기
    char write_buffer[1024];  // 충분한 버퍼 크기
    if (size + 2 < sizeof(write_buffer)) {
        // 원본 데이터 복사
        memcpy(write_buffer, data, size);
        // 줄바꿈 추가
        write_buffer[size] = '\r';
        write_buffer[size + 1] = '\n';
        
        // 파일에 쓰기 (파일은 이미 열려있음)
        UINT bytes_written;
        FRESULT write_result = f_write(&g_persistent_log_file, write_buffer, size + 2, &bytes_written);
        
        if (write_result == FR_OK && bytes_written == size + 2) {
            // 즉시 동기화 (파일은 열린 상태로 유지)
            f_sync(&g_persistent_log_file);
            g_current_log_size += bytes_written;
            LOG_DEBUG("[SDStorage] Persistent write successful: %d bytes", bytes_written);
            return SDSTORAGE_OK;
        } else {
            LOG_ERROR("[SDStorage] Persistent write failed: %d, written: %d/%d", write_result, bytes_written, size + 2);
            // 쓰기 실패 시 파일 다시 열기 시도
            _close_persistent_file();
            return SDSTORAGE_FILE_ERROR;
        }
    } else {
        LOG_ERROR("[SDStorage] Data too large for write buffer: %d bytes", size);
        return SDSTORAGE_INVALID_PARAM;
    }
    
    // 기존 방식 보존 (주석 처리)
    /*
    // STM32 환경: 안정적인 열기-쓰기-닫기 방식
    
    // 로그 파일명이 없으면 생성
    if (strlen(g_current_log_file) == 0) {
        if (_generate_log_filename(g_current_log_file, sizeof(g_current_log_file)) != SDSTORAGE_OK) {
            LOG_ERROR("[SDStorage] Failed to generate log filename");
            return SDSTORAGE_ERROR;
        }
    }
    
    // SD 카드 상태 변화에 robust한 방식: 매번 열고 닫기
    FIL temp_file;
    memset(&temp_file, 0, sizeof(temp_file));
    
    // 파일 닫기 보장: 이전에 열린 파일이 있으면 강제로 닫기
    _ensure_file_closed();
    
    // 성공 프로젝트 방식: 디스크 상태 먼저 확인
    DSTATUS current_disk_stat = disk_status(0);
    if (current_disk_stat != 0) {
        LOG_WARN("[SDStorage] Disk not ready (%d), reinitializing...", current_disk_stat);
        DSTATUS init_result = disk_initialize(0);
        if (init_result != 0) {
            LOG_ERROR("[SDStorage] Disk reinitialization failed: %d", init_result);
            return SDSTORAGE_NOT_READY;
        }
    }
    
    // 파일 열기 (성공 프로젝트 방식: 단계적 시도)
    FRESULT open_result = f_open(&temp_file, g_current_log_file, FA_OPEN_APPEND | FA_WRITE);
    
    // 파일 열기 성공 시 추적 등록
    if (open_result == FR_OK) {
        _register_file_opened(&temp_file, g_current_log_file);
        LOG_DEBUG("[SDStorage] File opened and registered: %s", g_current_log_file);
    }
    
    // f_open 실패 시 성공 프로젝트 방식의 복구 로직
    if (open_result != FR_OK) {
        LOG_WARN("[SDStorage] f_open failed (%d), trying recovery...", open_result);
        
        // 1단계: 마운트 재시도
        f_mount(NULL, SDPath, 0);  // 언마운트
        HAL_Delay(200);
        FRESULT remount_result = f_mount(&SDFatFS, SDPath, 1);  // 강제 재마운트
        
        if (remount_result == FR_OK) {
            // 재마운트 성공 후 다시 파일 열기 시도
            open_result = f_open(&temp_file, g_current_log_file, FA_OPEN_APPEND | FA_WRITE);
            if (open_result == FR_OK) {
                _register_file_opened(&temp_file, g_current_log_file);
                LOG_INFO("[SDStorage] File opened after remount recovery");
            }
        }
        
