dpcivl/lora_tester/lora_tester_stm32/Core/Src/SDStorage.c
        // 2단계: 여전히 실패하면 f_mkfs 시도
        if (open_result != FR_OK) {
            LOG_WARN("[SDStorage] File still failed, trying f_mkfs recovery...");
            static BYTE work[4096];
            FRESULT mkfs_result = f_mkfs(SDPath, FM_ANY, 0, work, sizeof(work));
            
            if (mkfs_result == FR_OK) {
                LOG_INFO("[SDStorage] f_mkfs successful, remounting...");
                f_mount(NULL, SDPath, 0);
                HAL_Delay(500);
                remount_result = f_mount(&SDFatFS, SDPath, 1);
                
                if (remount_result == FR_OK) {
                    // 파일명 재생성 (mkfs 후 파일이 사라졌으므로)
                    _generate_log_filename(g_current_log_file, sizeof(g_current_log_file));
                    open_result = f_open(&temp_file, g_current_log_file, FA_CREATE_ALWAYS | FA_WRITE);
                    if (open_result == FR_OK) {
                        _register_file_opened(&temp_file, g_current_log_file);
                        LOG_INFO("[SDStorage] File created after f_mkfs recovery");
                    }
                }
            }
        }
        
        // 모든 복구 시도 실패
        if (open_result != FR_OK) {
            LOG_ERROR("[SDStorage] All recovery attempts failed: %d", open_result);
            return SDSTORAGE_FILE_ERROR;
        }
    }
    
    if (open_result == FR_OK) {
        // FA_OPEN_APPEND 사용 시 자동으로 파일 끝에 위치
        
        // 원본 데이터 + 줄바꿈을 함께 쓰기 (FR_INVALID_OBJECT 방지)
        char write_buffer[512];  // 충분한 버퍼 크기
        UINT total_bytes_to_write = size + 2;  // 원본 데이터 + \r\n
        
        if (size + 2 < sizeof(write_buffer)) {
            // 원본 데이터 복사
            memcpy(write_buffer, data, size);
            // 줄바꿈 추가
            write_buffer[size] = '\r';
            write_buffer[size + 1] = '\n';
            
            // 한 번에 쓰기
            UINT bytes_written;
            FRESULT write_result = f_write(&temp_file, write_buffer, total_bytes_to_write, &bytes_written);
            
            // 즉시 동기화 및 닫기
            f_sync(&temp_file);
            f_close(&temp_file);
            _register_file_closed();  // 추적 해제
            
            if (write_result == FR_OK && bytes_written == total_bytes_to_write) {
                g_current_log_size += bytes_written;
                LOG_DEBUG("[SDStorage] Log written successfully: %d bytes (including CRLF)", bytes_written);
                return SDSTORAGE_OK;
            } else {
                LOG_ERROR("[SDStorage] f_write failed: %d, written: %d/%d", write_result, bytes_written, total_bytes_to_write);
                return SDSTORAGE_FILE_ERROR;
            }
        } else {
            // 버퍼 크기 초과 - 원본 데이터만 쓰기
            UINT bytes_written;
            FRESULT write_result = f_write(&temp_file, data, size, &bytes_written);
            
            // 즉시 동기화 및 닫기
            f_sync(&temp_file);
            f_close(&temp_file);
            _register_file_closed();  // 추적 해제
            
            if (write_result == FR_OK && bytes_written == size) {
                g_current_log_size += bytes_written;
                LOG_DEBUG("[SDStorage] Log written successfully: %d bytes (no CRLF due to size)", bytes_written);
                return SDSTORAGE_OK;
            } else {
                LOG_ERROR("[SDStorage] f_write failed: %d, written: %d/%d", write_result, bytes_written, size);
                return SDSTORAGE_FILE_ERROR;
            }
        }
    } else {
        LOG_ERROR("[SDStorage] f_open failed: %d - SD card state may have changed", open_result);
        
        // SD 카드 상태 재확인
        DSTATUS current_status = disk_status(0);
        LOG_WARN("[SDStorage] Current disk status: 0x%02X", current_status);
        
        if (current_status != 0) {
            LOG_WARN("[SDStorage] SD card not ready - temporarily disabling SD logging");
            return SDSTORAGE_NOT_READY;
        }
        
        return SDSTORAGE_FILE_ERROR;
    }
    */
#else
    // PC/테스트 환경: 파일 I/O 시뮬레이션 (항상 성공)
    // 실제 파일 쓰기 없이 성공으로 처리
#endif

    g_current_log_size += size;
    return SDSTORAGE_OK;
}

bool SDStorage_IsReady(void)
{
    return g_sd_ready;
}

void SDStorage_Disconnect(void)
{
    if (g_sd_ready) {
#ifdef STM32F746xx
        // 지속적 파일 닫기 후 마운트 해제
        _close_persistent_file();
        f_mount(NULL, SDPath, 0);
#else
        if (g_log_file != NULL) {
            fclose(g_log_file);
            g_log_file = NULL;
        }
#endif
        
        g_sd_ready = false;
        g_current_log_size = 0;
        memset(g_current_log_file, 0, sizeof(g_current_log_file));
    }
}

int SDStorage_CreateNewLogFile(void)
{
    if (!g_sd_ready) {
        return SDSTORAGE_NOT_READY;
    }
    
    // 전역 파일 객체 제거됨 - 별도 처리 불필요
    
    // 새 파일명 생성
    if (_generate_log_filename(g_current_log_file, sizeof(g_current_log_file)) != SDSTORAGE_OK) {
        return SDSTORAGE_ERROR;
    }
    
    // 파일 생성 테스트 (간단한 방식)
#ifdef STM32F746xx
    LOG_INFO("[SDStorage] Testing file creation: %s", g_current_log_file);
    
    // 지역 변수로 파일 객체 생성
    FIL test_file;
    memset(&test_file, 0, sizeof(test_file));
    
    // SD 카드 상태 재확인
    DSTATUS current_disk_status = disk_status(0);
    LOG_INFO("[SDStorage] Current disk status: 0x%02X", current_disk_status);
    
    // 파일 생성 테스트
    FRESULT open_result = f_open(&test_file, g_current_log_file, FA_CREATE_ALWAYS | FA_WRITE);
    LOG_INFO("[SDStorage] f_open result: %d", open_result);
    
    if (open_result != FR_OK) {
        LOG_ERROR("[SDStorage] f_open failed: %d", open_result);
        
        // 상세 에러 분석
        switch (open_result) {
            case 16: // FR_INVALID_OBJECT
                LOG_ERROR("[SDStorage] FR_INVALID_OBJECT - File object initialization issue");
                break;
            case 9: // FR_WRITE_PROTECTED  
                LOG_ERROR("[SDStorage] FR_WRITE_PROTECTED - SD card is write protected");
                break;
            case 3: // FR_NOT_READY
                LOG_ERROR("[SDStorage] FR_NOT_READY - Disk not ready");
                break;
            default:
                LOG_ERROR("[SDStorage] Unknown f_open error: %d", open_result);
                break;
        }
        
        LOG_WARN("[SDStorage] Disabling SD logging due to file creation failure");
        g_sd_ready = false;  // SD 로깅 비활성화
        return SDSTORAGE_FILE_ERROR;
    }
    
    // 파일 생성 확인 후 즉시 닫기 (추적 등록 없이)
    f_close(&test_file);
    LOG_INFO("[SDStorage] File created and ready for logging: %s", g_current_log_file);
#else
    // PC/테스트 환경: 파일 생성 시뮬레이션 (항상 성공)
    LOG_INFO("[SDStorage] Test environment - file creation simulated");
#endif
    
    g_current_log_size = 0;
    return SDSTORAGE_OK;
}

size_t SDStorage_GetCurrentLogSize(void)
{
    return g_current_log_size;
}

// 내부 함수 구현
static int _create_log_directory(void)
{
#ifdef STM32F746xx
    // FatFs가 이미 정상 동작하므로 HAL 테스트 불필요
    
    // f_mkdir 전에 볼륨 상태 재확인 (에러 6 방지)
    LOG_INFO("[SDStorage] Verifying volume state before f_mkdir...");
    
    // 볼륨 재마운트 시도 (상태 안정화)
    FRESULT remount_result = f_mount(&SDFatFS, SDPath, 1);
    LOG_INFO("[SDStorage] Volume re-mount result: %d", remount_result);
    
    FRESULT mkdir_result = FR_NOT_ENABLED;  // 초기값 설정
    
    if (remount_result == FR_OK) {
        LOG_INFO("[SDStorage] Volume ready - attempting f_mkdir...");
        mkdir_result = f_mkdir("lora_logs");
        LOG_INFO("[SDStorage] f_mkdir result: %d", mkdir_result);
    } else {
        LOG_ERROR("[SDStorage] Volume re-mount failed: %d", remount_result);
    }
    
    // FR_EXIST(9)는 이미 존재함을 의미하므로 성공으로 처리
    if (mkdir_result == FR_OK || mkdir_result == FR_EXIST) {
        LOG_INFO("[SDStorage] Directory ready (created or already exists)");
        return SDSTORAGE_OK;  // 디렉토리 성공
    } else {
        LOG_ERROR("[SDStorage] f_mkdir failed: %d - FatFs level problem", mkdir_result);
        LOG_INFO("[SDStorage] Will try direct file creation without directory");
        return SDSTORAGE_ERROR;  // 디렉토리 실패
    }
#else
    // PC: mkdir 시뮬레이션 (테스트에서는 성공으로 가정)
    LOG_INFO("[SDStorage] Test environment - directory creation simulated");
    return SDSTORAGE_OK;
#endif
}

// static uint32_t _get_current_timestamp(void) - unused function removed
// {
// #ifdef STM32F746xx
//     return HAL_GetTick();
// #else
//     return (uint32_t)time(NULL);
// #endif
// }